#include<stdio.h>
#include<string.h>
int main(int argc, const char *argv[])
{
	int i;

	char str[1000];

	for(i = 0;i < 1000;i ++)
	{
		str[i] = -1 - i;
	}
//	printf("%s\n",str);
	printf("%d\n",strlen(str));
	return 0;
}
#if 0
-1
原码：1 30个0 1
反码：1 30个1 0
补码：1 31个1 
str[0] 存放的是 11111111

-2:
原码：1 29个0 10 
反码：1 29个1 01 
补码：1 30个1 0
str[1] 存放的是 11111110
-3的补码：11111101
-4补码：  11111100 

str[0] - str[127]  存储的是 -1 到 -128对应补码的最后8位

当i = 128时，str[128] = -129

-129
原码：1  23个0   10000001
反码：1  23个1   01111110
补码：1  23个1   01111111
str[128]真正存放的是 01111111

-130的补码最后8位  01111110
#endif
